Autodesk.Revit.DB.Events.ExternalDataTypeUpdatedDataSourceIntoDocumentEventArgs.ItemId
The id of the external data item to which the external data type is updated.
Since:
2025.2

Autodesk.Revit.DB.Events.ExternalDataTypeUpdatedDataSourceIntoDocumentEventArgs.ProjectId
The id of the external project of the external data item to which the external data type is updated.
Since:
2025.2

Autodesk.Revit.DB.Events.ExternalDataTypeUpdatedDataSourceIntoDocumentEventArgs.TypeId
The type id of the external data type that is being updated.
Since:
2025.2

Autodesk.Revit.DB.Events.ExternalDataTypeUpdatedDataSourceIntoDocumentEventArgs
The event arguments used by the ExternalDataTypeUpdatedInto event.
Since:
2025.2